module empty_slot_check (
    input  [63:0] data_in,    // ورودی ۶۴ بیتی
    output [3:0]  slot_status // خروجی ۴ بیتی
);

    assign slot_status[3] = (data_in[63] === 1'b0) ? 1'b1 : 1'b0;
    assign slot_status[2] = (data_in[47] === 1'b0) ? 1'b1 : 1'b0;
    assign slot_status[1] = (data_in[31] === 1'b0) ? 1'b1 : 1'b0;
    assign slot_status[0] = (data_in[15] === 1'b0) ? 1'b1 : 1'b0;
    // اگر مقدار بیت تعین کننده خالی-اعتبار 1 باشد به این معنی است اسلات خالی نیست پس 0 به عنوان خروجی بده
    // اگر مقدار بیت تعین کننده خالی-اعتبار 0 باشد به این معنی است اسلات خالی است پس 1 به عنوان خروجی بده
    // در واقع خروجی مدار معکوس بیت های خالی-اعتبار است

    // در شرایطی که مقدار حاافظه ایکس است عملگر مقایسه ای سه گانه کاری میکنه که خروجی صفر بده
    // یعنی با بودن ایکس ما اون اسلات رو خالی در نظر میگیریم
    // X ==> Empty
    // (===) operator check X value

endmodule
